package playground.android.me.sr1.androidplayground.utils;

import java.util.ArrayList;

/**
 * Created by sr1 on 15/8/12.
 */
public class DataHelper {

    public static ArrayList<ChapterData> getChapterData() {
        ArrayList<ChapterData> data = new ArrayList<ChapterData>();

        data.add(new ChapterData(
                    "驴马争锋",
                    "2015-07-30",
                    "　　有一个农夫，到山里买了一匹马和一头驴，他牵着马和驴顺着山路往家赶。\n" +
                    "　　尽管山路又陡又窄、崎岖不平。但是驴子跟着农夫的步伐，走得很快，把马远远地甩在后面。农夫多次催促，可马刚赶上几步又落在了后面。\n" +
                    "　　 “让你偷懒，看我怎么收拾你！”农夫非常生气，一鞭子抽过去，马疼得一激灵，委屈地解释道：“不是我不卖力，我们马擅长走平地，而驴却擅长走山路。”\n" +
                    "　　“好，我早晚给你走平地的机会，到时候看你还有什么话说。”农夫以为马是在找借口。\n" +
                    "　　有了路上的经历，农夫非常喜欢和自己步调一致的驴子。回到了家里，把驴子安排到磨坊负责拉磨碾谷物，既没有风吹雨淋，也没有日晒霜打，并且每天的口粮还比马多两个玉米棒子。而马呢，被农夫用来耕地拉车，每天从早干到晚，活儿非常累。\n" +
                    "　　时间一长，马实在熬不住了，忍受不了农夫的不公平待遇。它找到农夫，说：“我想和驴子在平地上比走路，如果我赢了，希望您能提高我的口粮。”\n" +
                    "　　“好！我当时说过要给你平地上比赛走路的机会，今天就兑现，如果你输了，可别怪我不给你机会。”农夫答应了马的要求。\n" +
                    "　　于是，农夫叫上马和驴子，一起来到门前的一棵大树旁，宣布了比赛规则：“请你们分别绕树转圈。转的圈数多的获胜。”\n" +
                    "　　比赛开始了，最初马的速度很快，驴落在了后面；但过了一会儿，马慢慢地觉得头晕目眩，脚步也渐渐慢了下来，而驴还像开始时那样从容；又过了一会儿，马一阵眩晕，突然倒在了地上。而驴似乎没有任何疲惫的迹象，继续绕树转圈儿。\n" +
                    "　　农夫宣布比赛结束。驴子获胜。\n" +
                    "　　“怎么样？你不是整天想着在平地上跟驴比试走路吗？现在认输了吧？”农夫手叉着腰问。\n" +
                    "　　马想说些什么，但张了张嘴，什么也没说出来。\n" +
                    "　　后来，驴子继续在磨坊拉磨，而马也还继续耕地拉车，风里来雨里去，每天吃那可怜的几个玉米棒子。\n" +
                    "　　日子在平静中度过，直到有一天被农夫的儿子打破。农夫的儿子食物中毒，需要紧急赶到五里路外的镇上去抢救。\n" +
                    "　　农夫非常着急，他想起了上次比赛获胜的驴子，于是急匆匆地把驴子从磨坊牵出来套上车，载着儿子往镇上赶，可无论他怎么吆喝。驴子就是原地打转，一阵折腾后，儿子断了气……"
                ));
        data.add(new ChapterData(
                    "征服的人生",
                    "2015-07-29",
                    "　　一名劫犯在抢劫洛杉矶银行时被警察包围，无路可退。情急之下，劫犯顺手从人群中拉过一人当人质。他用枪顶着人质的头部，威胁警察不要走近，并且喝令人质要听从他的命令。\n" +
                    "　　警察四面包围，但不敢上前。劫犯挟持人质向外突围。突然，人质大声呻吟起来。劫犯喝令人质住口，但人质的呻吟声越来越大，最后竟然成了痛苦的呐喊。\n" +
                    "　　劫犯慌乱之中才注意到人质原来是一个孕妇。她痛苦的声音和表情证明她在极度惊吓之下马上要生产。鲜血已经染红了孕妇的衣服，情况十分危急。\n" +
                    "　　一边是漫长无期的牢狱之灾，一边是一条即将出生的生命。劫犯犹豫了，选择一个便意味着放弃另一个，而每一个选择都是无比艰难的。四周的人群，包括警察在内都注视着劫犯的一举一动，因为劫犯目前的选择是一场良心、道德与金钱、罪恶的较量。\n" +
                    "　　终于，劫犯缓缓举起了枪——他将枪扔在了地上，随即举起了双手。警察一拥而上，围观者竟然响起了掌声。\n" +
                    "　　孕妇已不能自持，众人要送她去医院。已戴上手铐的劫犯忽然说：“请等一等，好吗？我是医生！”警察迟疑了一下，劫犯继续说，“孕妇已无法坚持到医院，随时会有生命危险，请相信我！”警察终于打开了劫犯的手铐。\n" +
                    "　　一声洪亮的啼哭声惊动了所有听到它的人。人们欢声高呼，相互拥抱。劫犯双手沾满鲜血——是一个崭新生命的鲜血，而不是罪恶的鲜血。他的脸上挂着职业的满足和微笑。人们向他致意，忘了他是一个劫犯。\n" +
                    "　　当警察将手铐戴在他手上时，他说：“谢谢你们让我尽了一个医生的职责。这个小生命是我从医以来第一个在我枪口下出生的婴儿，他的勇敢征服了我。我现在感觉自己不是劫犯，而是一个救死扶伤的医生。”\n" +
                    "　　罪恶会被一个幼小的生命征服，不是因为他强大和伟大，而是仅仅在于他是一个需要生存权利的生命而已。生命的征服，就是如此简单。\n" +
                    "　　这是一个绝对真实的故事，它发生在美国的洛杉矶市。"
                ));
        data.add(new ChapterData(
                    "长得慢的树更能成材",
                    "2015-07-29",
                    "　　他叫阿尔伯特。因为母亲生他的时候难产，所以他从小就被认为是不祥之兆。\n" +
                    "　　阿尔伯特三岁多了还不会说话，父母担心他是哑巴，还曾带他去医院检查过。后来，阿尔伯特总算开口说话了，但是说得很不流利，而且他讲的每一句话都像是经过吃力的思考之后才说出来的。\n" +
                    "　　后来，阿尔伯特上学了。同学们都不愿意跟他交往，老师甚至毫不客气地对他父亲说：“你儿子智力迟钝，不守纪律，他将来是不会有什么出息的！”阿尔伯特因此极度自卑，在学校里几乎抬不起头来，整天只想着逃学。\n" +
                    "　　一天，父亲带他到郊外散心。父亲指着两棵树说：“你知道那是两棵什么树吗？”\n" +
                    "　　阿尔伯特迟钝地摇摇头：“不知道。”父亲说：“高的叫沙巴，矮的叫冷杉。你觉得哪棵树更珍贵？”阿尔伯特想了想说：“应该是沙巴树吧，你瞧，它长得那么高大。”\n" +
                    "　　“错！”父亲说，“长得快，木质一定疏松。长得慢，木质坚硬，才珍贵呢。而且，贪长的树很难成材，你别看沙巴树现在长得快，三年之后就不长了，很少有沙巴树能长得超过十米。冷杉却不同，别看它长得慢，但它始终如一地坚持生长。而且，它的寿命极长，活上万年都不成问题。”\n" +
                    "　　说着，父亲把他领到冷杉面前，这棵直插云霄的千年古树至今仍然生机勃勃。阿尔伯特仰着头，若有所思地说：“爸爸，你是想让我做一棵树，做一棵虽然长得慢但是永不放弃的冷杉树，对不对？”父亲满意地点了点头。\n" +
                    "　　从此，阿尔伯特不再逃学了。有一天，在手工课上，阿尔伯特费了很大的劲做出了一只难看的小板凳，结果遭到了全班同学的嘲笑。但是，父亲没有嘲笑他，因为通过这只制作粗糙的小板凳，父亲看到儿子身上已经具备了一种难能可贵的韧性。\n" +
                    "　　你可能已经猜到阿尔伯特是谁了。没错！阿尔伯特经过不懈的努力，终于成为了二十世纪最伟大的物理学家、思想家和哲学家，他的全名是阿尔伯特·爱因斯坦。\n" +
                    "　　人生寄语\n" +
                    "　　如果你也是一个生性迟钝的孩子，读了爱因斯坦的故事，你还会为自己的不同寻常而自卑吗？记住，你是一棵长得慢的树，之所以长得慢，是因为你有足够的耐心和信心，去长成一棵参天大树。"
                ));
        data.add(new ChapterData(
                    "扫树叶的小和尚",
                    "2015-07-26",
                    "　　有个小和尚，每天早上负责清扫寺庙院子里的落叶。 \n" +
                    "　　清晨起床扫落叶实在是一件苦差事，尤其在秋冬之际，每一次起风时，树叶总随风飞舞落下。 \n" +
                    "　　每天早上都需要花费许多时间才能清扫完树叶，这实在让小和尚头痛不已。他一直想要找个好办法让自己轻松些。 \n" +
                    "　　后来有个和尚跟他说：“你在明天打扫之前先用力摇树，把落叶统统摇下来，后天就可以不用扫落叶了。 ” \n" +
                    "　　小和尚觉得这是个好办法，于是隔天他起了个大早，使劲的猛摇树，这样他就可以把今天跟明天的落叶一次扫干净了。这一天小和尚都非常开心。 \n" +
                    "　　第二天，小和尚到院子一看，不禁傻眼了。院子里如往日一样落叶满地。 \n" +
                    "　　老和尚走了过来，对小和尚说：“傻孩子，无论你今天怎么用力，明天的落叶还是会飘下来。” \n" +
                    "　　小和尚终于明白了，世上有很多事是无法提前的，唯有认真的活在当下，才是最真实的人生态度。 \n" +
                    "　　许多人喜欢预支明天的烦恼，想要早一步解决掉明天的烦恼。明天如果有烦恼，你今天是无法解决的，每一天都有每一天的人生功课要交，努力做好今天的功课再说吧！"
                ));
        data.add(new ChapterData(
                    "生活中的哲学",
                    "2015-07-13",
                    "　　1、有一天，我和外公去菜园子给菜浇水，外公带了一个水壶，领着我来到离菜园子不远的一个空房子里，空房子里有几个大水缸，上面都盖着盖子，也不知道哪个里面有水。外公走到一个水缸跟前，抬手拍了拍那个水缸，摇了摇头，说这个里面没有水，又继续往前走，一个个地拍，一个个地听，拍到第四个缸的时候，外公说这里面有水，就把缸盖打开，里面果然装满了水。外公灌了满满一壶，往回走的时候，我问外公：为什么拍一拍就能知道里面有没有水呢？外公说：装满水的缸拍的时候不很响，没有水的空缸拍的时候就会很响，所以就能判断出来哪个有水哪个没有水了。\n" +
                    "　　其实人也是这样，真正有水平的人，从来不张扬，总是安安静静的；而那些整日里夸夸其谈口若悬河的人，其实并没有真才实学。\n" +
                    "　　2、去省美术馆参观画展，我走到一幅很大很大的壁画前面，只见上面画了很多五颜六色的东西，究竟画的是什么东西，我看不出来，于是就在那仔细观察，仔细想，但过了一会，还是没有看出来，就不看了，打算先去看别的画。当我走到另一幅画跟前，再回头从远处看刚才那幅壁画的时候，一下子就看出来了，原来画的是山峰和云雾。刚才之所以没有看出来，是因为我离那幅画太近了的缘故，离远一点就很容易看出来了。\n" +
                    "　　距离就是这样一种奇怪的东西，所以，如果你想了解一个人，那么就和他保持一定的距离，这样才能真正认识他。\n" +
                    "　　3、小外甥在院子里玩，他的面前放着一张桌子，他想跳到桌子上，但跳了几下没能跳上去，他想了想，退后了几步，向前猛跑了几步，一下子就跳到了桌子上。\n" +
                    "　　在前进的路上，有的时候，我们遇到了阻碍，阻挡了我们的发展道路，这个时候，如果我们能够退一步，不失为一个明智之举，退一步，有时是一种必须。\n" +
                    "　　4、我六岁那年，父亲领着我去村外放牛，我高高兴兴地跟着父亲跑，一不小心被脚下的一块石头绊倒了，好在摔得不重，我爬起来，拍了拍身上的灰，继续跟着父亲向村外走去。回来的路上，我只顾着快点回家吃饭，又被那块石头绊倒了。父亲看见后就对我说：“来的时候已经被这块石头给绊倒过一次了，就应该长点记性，哪能又让它绊倒一次呢！”\n" +
                    "　　成长的路上，我们都难免会犯这样或那样的错误，人可以犯错误，但不能犯相同的错误，不能在同一个地方栽倒两次。\n" +
                    "　　5、姐夫家新买了一辆农用汽车，买回来以后，姐夫每天开着车满大街转悠，车上什么也不拉，就是在空跑。我有些不解，就问姐夫为什么要开着车空跑，姐夫告诉我说这是在磨合。他说每辆新车出厂以后，由于所有的零件都是新的，所以各部位零件相互之间咬合得不是那么密切，经过一段时间的磨合才能好。\n" +
                    "　　新婚夫妇之间也需要一个磨合的过程。两个原先各自独立的男女结合在一起，一开始肯定要有一些不适应，经过一段时间的磨合，双方增进了了解，适应了对方的习惯，才能快乐的生活在一起。\n" +
                    "　　6、小的时候经常去打鸟，于是大人就常用这样一道老掉牙的题来考我们小孩：树上有十个鸟，用枪打掉了一个，还剩几个？答案是一个不剩了，因为另外的九只鸟也给吓跑了。\n" +
                    "　　我家楼下有一个小杂货店，老板娘很不会做生意，有的时候顾客买到了质量有问题的商品，找到她的时候，她就对顾客恶语相向，还谩骂顾客，一点点的，周围的人都知道了她家的服务态度不好，就都不去她家买货了，没过半年，她家只好关门。其实，我们那里的住户有一百多家，和她吵架的也就五六家，但因为得罪了五六家人，所以坏名声传出去了，其他那些人家也就都不来了。\n" +
                    "　　7、我家的园子里有一棵果树，爸爸每到春天的时候就会用剪刀给果树剪枝，我问爸爸为什么要给果树剪枝，爸爸回答说，如果果树不剪枝，那么它的营养就会分散，营养一分散，果子就长不大，剪掉多余的树枝，使营养能够集中供应到保留的那几棵树枝上，那么上面的果子就会长得又大又好吃。\n" +
                    "　　许多人在年轻的时候，会为自己定下许多理想，同时学习许多种不同类型的知识，想把自己培养成一个无所不能的通才。但人的精力是有限的，人不可能什么都精通，结果是样样通样样松，什么都会一点，却又没有一样精通。学贵专精，把不适合自己的那些理想剪掉，把有限的精力集中在一两项专业上，那样才能有成就。"
        ));

        return data;
    }


    public static class ChapterData {
        public String mTitle;
        public String mDate;
        public String mContent;

        public ChapterData(String title, String date, String content) {
            this.mTitle = title;
            this.mDate = date;
            this.mContent = content;
        }
    }
}
